SpenceKonde/DxCore/megaavr/boards.txt
avrdb.menu.attach.allenabled=On all pins, like usual
avrdb.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdb.menu.attach.manual=Only enabled ports. Please see documentation.
avrdb.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdb.menu.attach.oldversion=Old version, new one is worse!
avrdb.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD

#------------------------------------#
# MVIO menu                          #
#____________________________________#

#avrdb.menu.mvio.enabled=Enabled
#avrdb.menu.mvio.enabled.bootloader.mviobits=01
#avrdb.menu.mvio.disabled=Disabled
#avrdb.menu.mvio.disabled.bootloader.mviobits=10

#------------------------------------#
# Startup time options               #
#____________________________________#
avrdb.menu.startuptime.8= 8ms
avrdb.menu.startuptime.0= 0ms
avrdb.menu.startuptime.1= 1ms
avrdb.menu.startuptime.2= 2ms
avrdb.menu.startuptime.4= 4ms
avrdb.menu.startuptime.16= 16ms
avrdb.menu.startuptime.32= 32ms
avrdb.menu.startuptime.64= 64ms
avrdb.menu.startuptime.0.bootloader.sutbits=000
avrdb.menu.startuptime.1.bootloader.sutbits=001
avrdb.menu.startuptime.2.bootloader.sutbits=010
avrdb.menu.startuptime.4.bootloader.sutbits=011
avrdb.menu.startuptime.8.bootloader.sutbits=100
avrdb.menu.startuptime.16.bootloader.sutbits=101
avrdb.menu.startuptime.32.bootloader.sutbits=110
avrdb.menu.startuptime.64.bootloader.sutbits=111

#------------------------------------#
# SPM (writing flash from app)       #
#____________________________________#
avrdb.menu.appspm.no=Disabled
avrdb.menu.appspm.no.bootloader.appspm=
avrdb.menu.appspm.no.build.appspmabr=
avrdb.menu.appspm.no.bootloader.BOOTSIZE=0x00
avrdb.menu.appspm.full=Anywhere
avrdb.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
avrdb.menu.appapm.full.build.appspmabr=.spmALL
avrdb.menu.appspm.16plus=Above 16k
avrdb.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
avrdb.menu.appspm.16plus.bootloader.CODESIZE=32
avrdb.menu.appspm.24plus=Above 24k
avrdb.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
avrdb.menu.appspm.24plus.bootloader.CODESIZE=48
avrdb.menu.appspm.32plus=Above 32k (AVR128/64 only)
avrdb.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
avrdb.menu.appspm.32plus.bootloader.CODESIZE=64
avrdb.menu.appspm.48plus=Above 48k (AVR128/64 only)
avrdb.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
avrdb.menu.appspm.48plus.bootloader.CODESIZE=96
avrdb.menu.appspm.56plus=Above 56k (AVR128/64 only)
avrdb.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
avrdb.menu.appspm.56plus.bootloader.CODESIZE=112
avrdb.menu.appspm.64plus=Above 64k (AVR128 only)
avrdb.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
avrdb.menu.appspm.64plus.bootloader.CODESIZE=128
avrdb.menu.appspm.96plus=Above 96k (AVR128 only)
avrdb.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
avrdb.menu.appspm.96plus.bootloader.CODESIZE=192
avrdb.menu.appspm.112plus=Above 112k (AVR128 only)
avrdb.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
avrdb.menu.appspm.112plus.bootloader.CODESIZE=224

##########################################################################
#                                                                        #
###                 ###  #     # ####      ####  ####                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #   #             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  ####                  ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DD parts   #
#________________________________________#
#avrdd.upload.tool=avrdude
#avrdd.build.board=avrda
#avrdd.build.core=dxcore
#avrdd.build.text_section_start=.text=0x0
#avrdd.build.extra_flags={bootloader.appspm}
#avrdd.build.export_merged_output=false
#avrdd.build.printf=
#------------------------------------#
# Bootloading parameters and fuses   #
#____________________________________#
#avrdd.bootloader.tool=avrdude
#avrdd.bootloader.WDTCFG=0x00
#avrdd.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
#avrdd.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
#avrdd.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
#avrdd.bootloader.CODESIZE=0x00
#avrdd.bootloader.BOOTSIZE=0x01
#avrdd.bootloader.avrdudestring=
#avrdd.bootloader.pymcuprogstring=-aerase
#------------------------------------#
# Exported hex/lst/map names will    #
# indicate selected options. These   #
# are only to do that, nothing else  #
#____________________________________#
#avrdd.build.mcupostfix=
#avrdd.build.printfabr=
#avrdd.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DD submenu options                 #
#________________________________________#
# Chip (memory and pincount)         #
# 14/20-pin parts get default millis #
# changed just like tinyAVRs do      #
#____________________________________#
#avrdd.menu.chip.64DD14=AVR64DD14
#avrdd.menu.chip.64DD14.build.mcu=avr64dd14
#avrdd.menu.chip.64DD14.upload.maximum_size=65536
#avrdd.menu.chip.64DD14.upload.maximum_data_size=8192
#avrdd.menu.chip.64DD14.build.highestcb=B1
#avrdd.menu.chip.64DD14.build.variant=14pin-ddseries
#avrdd.menu.chip.64DD20=AVR64DD20
#avrdd.menu.chip.64DD20.build.mcu=avr64dd20
#avrdd.menu.chip.64DD20.upload.maximum_size=65536
#avrdd.menu.chip.64DD20.upload.maximum_data_size=8192
#avrdd.menu.chip.64DD20.build.highestcb=B1
#avrdd.menu.chip.64DD20.build.variant=20pin-ddseries
#avrdd.menu.chip.64DD28=AVR64DD28
#avrdd.menu.chip.64DD28.build.mcu=avr64dd28
#avrdd.menu.chip.64DD28.upload.maximum_size=65536
#avrdd.menu.chip.64DD28.upload.maximum_data_size=8192
#avrdd.menu.chip.64DD28.build.variant=28pin-ddseries
#avrdd.menu.chip.64DD32=AVR64DD32
#avrdd.menu.chip.64DD32.build.mcu=avr64dd32
#avrdd.menu.chip.64DD32.upload.maximum_size=65536
#avrdd.menu.chip.64DD32.upload.maximum_data_size=8192
#avrdd.menu.chip.64DD32.build.variant=32in-ddseries
#avrdd.menu.chip.32DD14=AVR32DD14
#avrdd.menu.chip.32DD14.build.mcu=avr32dd14
#avrdd.menu.chip.32DD14.upload.maximum_size=32768
#avrdd.menu.chip.32DD14.upload.maximum_data_size=4096
#avrdd.menu.chip.32DD14.build.highestcb=B1
#avrdd.menu.chip.32DD14.build.variant=14pin-ddseries
#avrdd.menu.chip.32DD20=AVR32DD20
#avrdd.menu.chip.32DD20.build.mcu=avr32dd20
#avrdd.menu.chip.32DD20.upload.maximum_size=32768
#avrdd.menu.chip.32DD20.upload.maximum_data_size=4096
#avrdd.menu.chip.32DD20.build.highestcb=B1
#avrdd.menu.chip.32DD20.build.variant=20pin-ddseries
#avrdd.menu.chip.32DD28=AVR32DD28
#avrdd.menu.chip.32DD28.build.mcu=avr32dd28
#avrdd.menu.chip.32DD28.upload.maximum_size=32768
#avrdd.menu.chip.32DD28.upload.maximum_data_size=4096
#avrdd.menu.chip.32DD28.build.variant=28pin-ddseries
#avrdd.menu.chip.32DD32=AVR32DD32
#avrdd.menu.chip.32DD32.build.mcu=avr32dd32
#avrdd.menu.chip.32DD32.upload.maximum_size=32768
#avrdd.menu.chip.32DD32.upload.maximum_data_size=4096
#avrdd.menu.chip.32DD32.build.variant=32in-ddseries
#avrdd.menu.chip.16DD14=AVR16DD14
#avrdd.menu.chip.16DD14.build.mcu=avr16dd14
#avrdd.menu.chip.16DD14.upload.maximum_size=16384
#avrdd.menu.chip.16DD14.upload.maximum_data_size=2048
#avrdd.menu.chip.16DD14.build.highestcb=B1
#avrdd.menu.chip.16DD14.build.variant=14pin-ddseries
#avrdd.menu.chip.16DD20=AVR16DD20
#avrdd.menu.chip.16DD20.build.mcu=avr16dd20
#avrdd.menu.chip.16DD20.upload.maximum_size=16384
#avrdd.menu.chip.16DD20.upload.maximum_data_size=2048
#avrdd.menu.chip.16DD20.build.highestcb=B1
#avrdd.menu.chip.16DD20.build.variant=20pin-ddseries
#avrdd.menu.chip.16DD28=AVR16DD28
#avrdd.menu.chip.16DD28.build.mcu=avr16dd28
#avrdd.menu.chip.16DD28.upload.maximum_size=16384
#avrdd.menu.chip.16DD28.upload.maximum_data_size=2048
#avrdd.menu.chip.16DD28.build.variant=28pin-ddseries
#avrdd.menu.chip.16DD32=AVR16DD32
#avrdd.menu.chip.16DD32.build.mcu=avr16dd32
#avrdd.menu.chip.16DD32.upload.maximum_size=16384
#avrdd.menu.chip.16DD32.upload.maximum_data_size=2048
#avrdd.menu.chip.16DD32.build.variant=32in-ddseries

#------------------------------------#
# Clock speed and source options     #
#____________________________________#
#avrdd.menu.clock.24internal=24 MHz internal
#avrdd.menu.clock.24internal.build.f_cpu=24000000L
#avrdd.menu.clock.24internal.build.speed=24
#avrdd.menu.clock.24internal.build.clocksource=0
#avrdd.menu.clock.20internal=20 MHz internal
#avrdd.menu.clock.20internal.build.f_cpu=20000000L
#avrdd.menu.clock.20internal.build.speed=20
#avrdd.menu.clock.20internal.build.clocksource=0
#avrdd.menu.clock.16internal=16 MHz internal
#avrdd.menu.clock.16internal.build.f_cpu=16000000L
#avrdd.menu.clock.16internal.build.speed=16
#avrdd.menu.clock.16internal.build.clocksource=0
#avrdd.menu.clock.12internal=12 MHz internal
#avrdd.menu.clock.12internal.build.f_cpu=12000000L
#avrdd.menu.clock.12internal.build.speed=12
#avrdd.menu.clock.12internal.build.clocksource=0
#avrdd.menu.clock.10internal=10 MHz internal
#avrdd.menu.clock.10internal.build.f_cpu=10000000L
#avrdd.menu.clock.10internal.build.speed=10
#avrdd.menu.clock.10internal.build.clocksource=0
#avrdd.menu.clock.8internal=8 MHz internal
#avrdd.menu.clock.8internal.build.f_cpu=8000000L
#avrdd.menu.clock.8internal.build.speed=8
#avrdd.menu.clock.8internal.build.clocksource=0
#avrdd.menu.clock.4internal=4 MHz internal
#avrdd.menu.clock.4internal.build.f_cpu=4000000L
#avrdd.menu.clock.4internal.build.speed=4
#avrdd.menu.clock.4internal.build.clocksource=0
#avrdd.menu.clock.1internal=1 MHz internal
#avrdd.menu.clock.1internal.build.f_cpu=1000000L
#avrdd.menu.clock.1internal.build.speed=1
#avrdd.menu.clock.1internal.build.clocksource=0
#avrdd.menu.clock.24crystal=24 MHz crystal
#avrdd.menu.clock.24crystal.build.f_cpu=24000000L
#avrdd.menu.clock.24crystal.build.speed=24
#avrdd.menu.clock.24crystal.build.clocksource=1
#avrdd.menu.clock.20crystal=20 MHz crystal
#avrdd.menu.clock.20crystal.build.f_cpu=20000000L
#avrdd.menu.clock.20crystal.build.speed=20
#avrdd.menu.clock.20crystal.build.clocksource=1
#avrdd.menu.clock.16crystal=16 MHz crystal
#avrdd.menu.clock.16crystal.build.f_cpu=16000000L
#avrdd.menu.clock.16crystal.build.speed=16
#avrdd.menu.clock.16crystal.build.clocksource=1
#avrdd.menu.clock.12crystal=12 MHz crystal
#avrdd.menu.clock.12crystal.build.f_cpu=12000000L
#avrdd.menu.clock.12crystal.build.speed=12
#avrdd.menu.clock.12crystal.build.clocksource=1
#avrdd.menu.clock.8crystal=8 MHz crystal
#avrdd.menu.clock.8crystal.build.f_cpu=8000000L
#avrdd.menu.clock.8crystal.build.speed=8
#avrdd.menu.clock.8crystal.build.clocksource=1
#avrdd.menu.clock.24extclock=24 MHz ext. clock
#avrdd.menu.clock.24extclock.build.f_cpu=24000000L
#avrdd.menu.clock.24extclock.build.speed=24
#avrdd.menu.clock.24extclock.build.clocksource=2
#avrdd.menu.clock.20extclock=20 MHz ext. clock
#avrdd.menu.clock.20extclock.build.f_cpu=20000000L
#avrdd.menu.clock.20extclock.build.speed=20
#avrdd.menu.clock.20extclock.build.clocksource=2
#avrdd.menu.clock.16extclock=16 MHz ext. clock
#avrdd.menu.clock.16extclock.build.f_cpu=16000000L
#avrdd.menu.clock.16extclock.build.speed=16
#avrdd.menu.clock.16extclock.build.clocksource=2
#avrdd.menu.clock.12extclock=12 MHz ext. clock
#avrdd.menu.clock.12extclock.build.f_cpu=12000000L
#avrdd.menu.clock.12extclock.build.speed=12
#avrdd.menu.clock.12extclock.build.clocksource=2
#avrdd.menu.clock.8extclock=8 MHz ext. clock
#avrdd.menu.clock.8extclock.build.f_cpu=8000000L
#avrdd.menu.clock.8extclock.build.speed=8
#avrdd.menu.clock.8extclock.build.clocksource=2
#avrdd.menu.clock.28internal=28 MHz internal (overclocked)
#avrdd.menu.clock.28internal.build.f_cpu=28000000L
#avrdd.menu.clock.28internal.build.speed=28
#avrdd.menu.clock.28internal.build.clocksource=0
#avrdd.menu.clock.32internal=32 MHz internal (overclocked)
#avrdd.menu.clock.32internal.build.f_cpu=32000000L
#avrdd.menu.clock.32internal.build.speed=32
#avrdd.menu.clock.32internal.build.clocksource=0
#avrdd.menu.clock.25crystal=25 MHz crystal (slightly overclocked)
#avrdd.menu.clock.25crystal.build.f_cpu=25000000L
#avrdd.menu.clock.25crystal.build.speed=25
#avrdd.menu.clock.25crystal.build.clocksource=1
#avrdd.menu.clock.28crystal=28 MHz crystal (overclocked)
#avrdd.menu.clock.28crystal.build.f_cpu=28000000L
#avrdd.menu.clock.28crystal.build.speed=28
#avrdd.menu.clock.28crystal.build.clocksource=1
#avrdd.menu.clock.32crystal=32 MHz crystal (overclocked)
#avrdd.menu.clock.32crystal.build.f_cpu=32000000L
#avrdd.menu.clock.32crystal.build.speed=32
#avrdd.menu.clock.32crystal.build.clocksource=1
#avrdd.menu.clock.36crystal=36 MHz crystal (overclocked)
#avrdd.menu.clock.36crystal.build.f_cpu=36000000L
#avrdd.menu.clock.36crystal.build.speed=36
#avrdd.menu.clock.36crystal.build.clocksource=1
#avrdd.menu.clock.40crystal=40 MHz crystal (overclocked)
#avrdd.menu.clock.40crystal.build.f_cpu=40000000L
#avrdd.menu.clock.40crystal.build.speed=40
#avrdd.menu.clock.40crystal.build.clocksource=1
#avrdd.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
#avrdd.menu.clock.25extclock.build.f_cpu=25000000L
#avrdd.menu.clock.25extclock.build.speed=25
#avrdd.menu.clock.25extclock.build.clocksource=2
#avrdd.menu.clock.28extclock=28 MHz ext. clock (overclocked)
#avrdd.menu.clock.28extclock.build.f_cpu=28000000L
#avrdd.menu.clock.28extclock.build.speed=28
#avrdd.menu.clock.28extclock.build.clocksource=2
#avrdd.menu.clock.32extclock=32 MHz ext. clock (overclocked)
#avrdd.menu.clock.32extclock.build.f_cpu=32000000L
#avrdd.menu.clock.32extclock.build.speed=32
#avrdd.menu.clock.32extclock.build.clocksource=2
#avrdd.menu.clock.36extclock=36 MHz ext. clock (overclocked)
#avrdd.menu.clock.36extclock.build.f_cpu=36000000L
#avrdd.menu.clock.36extclock.build.speed=36
#avrdd.menu.clock.36extclock.build.clocksource=2
#avrdd.menu.clock.40extclock=40 MHz ext. clock (overclocked)
#avrdd.menu.clock.40extclock.build.f_cpu=40000000L
#avrdd.menu.clock.40extclock.build.speed=40
#avrdd.menu.clock.40extclock.build.clocksource=2
#avrdd.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
#avrdd.menu.clock.48extclock.build.f_cpu=48000000L
#avrdd.menu.clock.48extclock.build.speed=48
#avrdd.menu.clock.48extclock.build.clocksource=2

#------------------------------------#
# BrownOut detection (BOD) options   #
#____________________________________#
#avrdd.menu.bodvoltage.1v9=1.9V
#avrdd.menu.bodvoltage.1v9.bootloader.bodlevbits=000
#avrdd.menu.bodvoltage.2v45=2.45V
#avrdd.menu.bodvoltage.2v45.bootloader.bodlevbits=001
#avrdd.menu.bodvoltage.2v70=2.70V
#avrdd.menu.bodvoltage.2v70.bootloader.bodlevbits=010
#avrdd.menu.bodvoltage.2v85=2.85V
#avrdd.menu.bodvoltage.2v85.bootloader.bodlevbits=011
#avrdd.menu.bodmode.disabled=Disabled/Disabled
#avrdd.menu.bodmode.enabled=Enabled/Enabled
#avrdd.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
#avrdd.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
#avrdd.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
#avrdd.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
#avrdd.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
#avrdd.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
#avrdd.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
#avrdd.menu.bodmode.disabled.bootloader.BODCFG=0x00
#avrdd.menu.bodmode.enabled.bootloader.bodmodebits=00101
#avrdd.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
#avrdd.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
#avrdd.menu.bodmode.samplefast.bootloader.bodmodebits=01010
#avrdd.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
#avrdd.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
#avrdd.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
#avrdd.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#------------------------------------#
# Retain EEPROM (EESAVE)             #
#____________________________________#
#avrdd.menu.eesave.enable=EEPROM retained
#avrdd.menu.eesave.enable.bootloader.eesavebit=1
#avrdd.menu.eesave.disable=EEPROM not retained
#avrdd.menu.eesave.disable.bootloader.eesavebit=0

#------------------------------------#
# Reset pin as INPUT, UPDI as I/O    #
#____________________________________#
#avrdd.menu.resetupdipins.reset=Reset & UPDI
#avrdd.menu.resetupdipins.reset.bootloader.resetpinbits=11
#avrdd.menu.resetupdipins.input=Input & UPDI (no challenges)
#avrdd.menu.resetupdipins.input.bootloader.resetpinbits=10
#avrdd.menu.resetupdipins.reset=Reset & GPIO (HV pulse RST for UPDI)
#avrdd.menu.resetupdipins.reset.bootloader.resetpinbits=01
#avrdd.menu.resetupdipins.input=Input & GPIO (HV pulse RST for UPDI)
#avrdd.menu.resetupdipins.input.bootloader.resetpinbits=00

#------------------------------------#
# millis/micros timing source        #
#____________________________________#
#avrdd.menu.millis.tcbhighest=TCB2 on 28/32pin else TCB1 (recommended)
#avrdd.menu.millis.disabled=Disabled (delay() only)
#avrdd.menu.millis.tcb0=TCB0
#avrdd.menu.millis.tcb1=TCB1 (same as first option on 14/20 pins)
##avrdd.menu.millis.rtc=RTC (no micros)
##avrdd.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal no micros
##avrdd.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
#avrdd.menu.millis.tcb0.build.millistimer={build.highestcb}
#avrdd.menu.millis.tcb1.build.millistimer=B0
#avrdd.menu.millis.tcb2.build.millistimer=B1
#avrdd.menu.millis.tca0.build.millistimer=A0
##avrdd.menu.millis.tcd0.build.millistimer=D0
##avrdd.menu.millis.rtc.build.millistimer=RTC
##avrdd.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
##avrdd.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
#avrdd.menu.millis.disabled.build.millistimer=NONE

