SpenceKonde/DxCore/megaavr/boards.txt
#------------------------------------#
# printf() version options           #
#____________________________________#
#avrdd.menu.printf.default=Default, 1.5k flash, no floats
#avrdd.menu.printf.full=Full, 2.6k, prints floats
#avrdd.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrdd.menu.printf.full.build.printfabr=.pfF
#avrdd.menu.printf.minimal=Minimal, 1.1k flash used
#avrdd.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrdd.menu.printf.minimal.build.printfabr=.pfM

#------------------------------------#
# MVIO menu                          #
#____________________________________#
#avrdd.menu.mvio.enabled=Enabled
#avrdd.menu.mvio.enabled.bootloader.mviobits=01
#avrdd.menu.mvio.disabled=Disabled
#avrdd.menu.mvio.disabled.bootloader.mviobits=10

#------------------------------------#
# Startup time options               #
#____________________________________#
#avrdd.menu.startuptime.8= 8ms
#avrdd.menu.startuptime.0= 0ms
#avrdd.menu.startuptime.1= 1ms
#avrdd.menu.startuptime.2= 2ms
#avrdd.menu.startuptime.4= 4ms
#avrdd.menu.startuptime.16= 16ms
#avrdd.menu.startuptime.32= 32ms
#avrdd.menu.startuptime.64= 64ms
#avrdd.menu.startuptime.0.bootloader.sutbits=000
#avrdd.menu.startuptime.1.bootloader.sutbits=001
#avrdd.menu.startuptime.2.bootloader.sutbits=010
#avrdd.menu.startuptime.4.bootloader.sutbits=011
#avrdd.menu.startuptime.8.bootloader.sutbits=100
#avrdd.menu.startuptime.16.bootloader.sutbits=101
#avrdd.menu.startuptime.32.bootloader.sutbits=110
#avrdd.menu.startuptime.64.bootloader.sutbits=111

#------------------------------------#
# SPM (writing flash from app)       #
# will initially be disabled until   #
# until size of these "pages" is     #
# known to be either 512 or 256b.    #
#____________________________________#
#avrdd.menu.appspm.no=Disabled (be patient!)
#avrdd.menu.appspm.no.bootloader.appspm=
#avrdd.menu.appspm.no.build.appspmabr=
#avrdd.menu.appspm.no.bootloader.BOOTSIZE=0x00
##avrdd.menu.appspm.full=Anywhere
##avrdd.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
#avrdd.menu.appapm.full.build.appspmabr=.spmALL
##avrdd.menu.appspm.16plus=Above 16k
##avrdd.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
##avrdd.menu.appspm.16plus.bootloader.CODESIZE=32
##avrdd.menu.appspm.24plus=Above 24k
##avrdd.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
##avrdd.menu.appspm.24plus.bootloader.CODESIZE=48
##avrdd.menu.appspm.32plus=Above 32k (AVR128/64 only)
##avrdd.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
##avrdd.menu.appspm.32plus.bootloader.CODESIZE=64
##avrdd.menu.appspm.48plus=Above 48k (AVR128/64 only)
##avrdd.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
##avrdd.menu.appspm.48plus.bootloader.CODESIZE=96
##avrdd.menu.appspm.56plus=Above 56k (AVR128/64 only)
##avrdd.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
##avrdd.menu.appspm.56plus.bootloader.CODESIZE=112
##avrdd.menu.appspm.64plus=Above 64k (AVR128 only)
##avrdd.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
##avrdd.menu.appspm.64plus.bootloader.CODESIZE=128
##avrdd.menu.appspm.96plus=Above 96k (AVR128 only)
##avrdd.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
##avrdd.menu.appspm.96plus.bootloader.CODESIZE=192
##avrdd.menu.appspm.112plus=Above 112k (AVR128 only)
##avrdd.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
##avrdd.menu.appspm.112plus.bootloader.CODESIZE=224

##########################################################################
#                                                                        #
###                 ###  #     # ####      #####   ###                 ###
#####              #   # #     # #   #     #      #   #              #####
#######            #####  #   #  ####  ### ####   #####            #######
#####              #   #   # #   # #       #      #   #              #####
###                #   #    #    #  #      #####  #   #                ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for EA parts   #
#________________________________________#
#avrea.upload.tool=avrdude
#avrea.build.board=avrda
#avrea.build.core=dxcore
#avrea.build.text_section_start=.text=0x0
#avrea.build.extra_flags=
#avrea.build.export_merged_output=false
#avrea.build.printf=
#------------------------------------#
# Bootloading parameters and fuses   #
#____________________________________#
#avrea.bootloader.tool=avrdude
#avrea.bootloader.WDTCFG=0x00
#avrea.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
#avrea.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
#avrea.bootloader.CODESIZE=0x00
#avrea.bootloader.BOOTSIZE=0x01
#avrea.bootloader.avrdudestring=
#avrea.bootloader.pymcuprogstring=-aerase
#------------------------------------#
# Exported hex/lst/map names will    #
# indicate selected options. These   #
# are only to do that, nothing else  #
#____________________________________#
#avrea.build.mcupostfix=
#avrea.build.printfabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-EA submenu options                 #
#________________________________________#
# Chip (memory and pincount)         #
#____________________________________#
#avrea.menu.chip.64DA28=AVR64DA28
#avrea.menu.chip.64DA28.build.mcu=avr64da28
#avrea.menu.chip.64DA28.upload.maximum_size=65536
#avrea.menu.chip.64DA28.upload.maximum_data_size=8192
#avrea.menu.chip.64DA28.build.variant=28pin-standard
#avrea.menu.chip.64DA32=AVR64DA32
#avrea.menu.chip.64DA32.build.mcu=avr64da32
#avrea.menu.chip.64DA32.upload.maximum_size=65536
#avrea.menu.chip.64DA32.upload.maximum_data_size=8192
#avrea.menu.chip.64DA32.build.variant=32pin-standard
#avrea.menu.chip.64DA48=AVR64DA48
#avrea.menu.chip.64DA48.build.mcu=avr64da48
#avrea.menu.chip.64DA48.upload.maximum_size=65536
#avrea.menu.chip.64DA48.upload.maximum_data_size=8192
#avrea.menu.chip.64DA48.build.variant=48pin-standard
#avrea.menu.chip.32DA28=AVR32DA28
#avrea.menu.chip.32DA28.build.mcu=avr32da28
#avrea.menu.chip.32DA28.upload.maximum_size=32768
#avrea.menu.chip.32DA28.upload.maximum_data_size=4096
#avrea.menu.chip.32DA28.build.variant=28pin-standard
#avrea.menu.chip.32DA32=AVR32DA32
#avrea.menu.chip.32DA32.build.mcu=avr32da32
#avrea.menu.chip.32DA32.upload.maximum_size=32768
#avrea.menu.chip.32DA32.upload.maximum_data_size=4096
#avrea.menu.chip.32DA32.build.variant=32pin-standard
#avrea.menu.chip.32DA48=AVR32DA48
#avrea.menu.chip.32DA48.build.mcu=avr32da48
#avrea.menu.chip.32DA48.upload.maximum_size=32768
#avrea.menu.chip.32DA48.upload.maximum_data_size=4096
#avrea.menu.chip.32DA48.build.variant=48pin-standard
#avrea.menu.chip.16DA28=AVR16DA28
#avrea.menu.chip.16DA28.build.mcu=avr16da28
#avrea.menu.chip.16DA28.upload.maximum_size=16384
#avrea.menu.chip.16DA28.upload.maximum_data_size=2048
#avrea.menu.chip.16DA28.build.variant=28pin-standard
#avrea.menu.chip.16DA32=AVR16DA32
#avrea.menu.chip.16DA32.build.mcu=avr16da32
#avrea.menu.chip.16DA32.upload.maximum_size=16384
#avrea.menu.chip.16DA32.upload.maximum_data_size=2048
#avrea.menu.chip.16DA32.build.variant=32pin-standard
#avrea.menu.chip.16DA48=AVR16DA48
#avrea.menu.chip.16DA48.build.mcu=avr16da48
#avrea.menu.chip.16DA48.upload.maximum_size=16384
#avrea.menu.chip.16DA48.upload.maximum_data_size=2048
#avrea.menu.chip.16DA48.build.variant=48pin-standard
#avrea.menu.chip.8DA28=AVR8DA28
#avrea.menu.chip.8DA28.build.mcu=avr8da28
#avrea.menu.chip.8DA28.upload.maximum_size=8192
#avrea.menu.chip.8DA28.upload.maximum_data_size=1024
#avrea.menu.chip.8DA28.build.variant=28pin-standard
#avrea.menu.chip.8DA32=AVR8DA32
#avrea.menu.chip.8DA32.build.mcu=avr8da32
#avrea.menu.chip.8DA32.upload.maximum_size=8192
#avrea.menu.chip.8DA32.upload.maximum_data_size=1024
#avrea.menu.chip.8EA32.build.variant=32pin-standard

#------------------------------------#
# Clock speed and source options     #
#____________________________________#
# No information on int. osc    #
# this imagines it's the Dx osc #
# but paper limit is lower      #
# 100% possible it could be more#
# like tiny, and this would need$
# to change accordingly.        #
#_______________________________#
#avrea.menu.clock.20internal=20 MHz internal
#avrea.menu.clock.20internal.build.f_cpu=20000000L
#avrea.menu.clock.20internal.build.speed=20
#avrea.menu.clock.20internal.build.clocksource=0
#avrea.menu.clock.16internal=16 MHz internal
#avrea.menu.clock.16internal.build.f_cpu=16000000L
#avrea.menu.clock.16internal.build.speed=16
#avrea.menu.clock.16internal.build.clocksource=0
#avrea.menu.clock.12internal=12 MHz internal
#avrea.menu.clock.12internal.build.f_cpu=12000000L
#avrea.menu.clock.12internal.build.speed=12
#avrea.menu.clock.12internal.build.clocksource=0
#avrea.menu.clock.10internal=10 MHz internal
#avrea.menu.clock.10internal.build.f_cpu=10000000L
#avrea.menu.clock.10internal.build.speed=10
#avrea.menu.clock.10internal.build.clocksource=0
#avrea.menu.clock.8internal=8 MHz internal
#avrea.menu.clock.8internal.build.f_cpu=8000000L
#avrea.menu.clock.8internal.build.speed=8
#avrea.menu.clock.8internal.build.clocksource=0
#avrea.menu.clock.4internal=4 MHz internal
#avrea.menu.clock.4internal.build.f_cpu=4000000L
#avrea.menu.clock.4internal.build.speed=4
#avrea.menu.clock.4internal.build.clocksource=0
#avrea.menu.clock.1internal=1 MHz internal
#avrea.menu.clock.1internal.build.f_cpu=1000000L
#avrea.menu.clock.1internal.build.speed=1
#avrea.menu.clock.1internal.build.clocksource=0
#avrea.menu.clock.20crystal=20 MHz crystal
#avrea.menu.clock.20crystal.build.f_cpu=20000000L
#avrea.menu.clock.20crystal.build.speed=20
#avrea.menu.clock.20crystal.build.clocksource=1
#avrea.menu.clock.16crystal=16 MHz crystal
#avrea.menu.clock.16crystal.build.f_cpu=16000000L
#avrea.menu.clock.16crystal.build.speed=16
#avrea.menu.clock.16crystal.build.clocksource=1
#avrea.menu.clock.12crystal=12 MHz crystal
#avrea.menu.clock.12crystal.build.f_cpu=12000000L
#avrea.menu.clock.12crystal.build.speed=12
#avrea.menu.clock.12crystal.build.clocksource=1
#avrea.menu.clock.8crystal=8 MHz crystal
#avrea.menu.clock.8crystal.build.f_cpu=8000000L
#avrea.menu.clock.8crystal.build.speed=8
#avrea.menu.clock.8crystal.build.clocksource=1
#avrea.menu.clock.20extclock=20 MHz ext. clock
#avrea.menu.clock.20extclock.build.f_cpu=20000000L
#avrea.menu.clock.20extclock.build.speed=20
#avrea.menu.clock.20extclock.build.clocksource=2
#avrea.menu.clock.16extclock=16 MHz ext. clock
#avrea.menu.clock.16extclock.build.f_cpu=16000000L
#avrea.menu.clock.16extclock.build.speed=16
#avrea.menu.clock.16extclock.build.clocksource=2
#avrea.menu.clock.12extclock=12 MHz ext. clock
#avrea.menu.clock.12extclock.build.f_cpu=12000000L
#avrea.menu.clock.12extclock.build.speed=12
#avrea.menu.clock.12extclock.build.clocksource=2
#avrea.menu.clock.8extclock=8 MHz ext. clock
#avrea.menu.clock.8extclock.build.f_cpu=8000000L
#avrea.menu.clock.8extclock.build.speed=8
#avrea.menu.clock.8extclock.build.clocksource=2
#avrea.menu.clock.24internal=24 MHz internal (overclocked)
#avrea.menu.clock.24internal.build.f_cpu=24000000L
#avrea.menu.clock.24internal.build.speed=24
#avrea.menu.clock.24internal.build.clocksource=0
#avrea.menu.clock.28internal=28 MHz internal (overclocked)
#avrea.menu.clock.28internal.build.f_cpu=28000000L
#avrea.menu.clock.28internal.build.speed=28
#avrea.menu.clock.28internal.build.clocksource=0
#avrea.menu.clock.32internal=32 MHz internal (overclocked)
#avrea.menu.clock.32internal.build.f_cpu=32000000L
#avrea.menu.clock.32internal.build.speed=32
#avrea.menu.clock.32internal.build.clocksource=0
#avrea.menu.clock.24crystal=24 MHz crystal (overclocked)
#avrea.menu.clock.24crystal.build.f_cpu=24000000L
#avrea.menu.clock.24crystal.build.speed=24
#avrea.menu.clock.24crystal.build.clocksource=1
#avrea.menu.clock.25crystal=25 MHz crystal (overclocked)
#avrea.menu.clock.25crystal.build.f_cpu=25000000L
#avrea.menu.clock.25crystal.build.speed=25
#avrea.menu.clock.25crystal.build.clocksource=1
#avrea.menu.clock.28crystal=28 MHz crystal (overclocked)
#avrea.menu.clock.28crystal.build.f_cpu=28000000L
#avrea.menu.clock.28crystal.build.speed=28
#avrea.menu.clock.28crystal.build.clocksource=1
#avrea.menu.clock.32crystal=32 MHz crystal (overclocked)
#avrea.menu.clock.32crystal.build.f_cpu=32000000L
#avrea.menu.clock.32crystal.build.speed=32
#avrea.menu.clock.32crystal.build.clocksource=1
#avrea.menu.clock.36crystal=36 MHz crystal (overclocked)
#avrea.menu.clock.36crystal.build.f_cpu=36000000L
#avrea.menu.clock.36crystal.build.speed=36
#avrea.menu.clock.36crystal.build.clocksource=1
#avrea.menu.clock.40crystal=40 MHz crystal (overclocked)
#avrea.menu.clock.40crystal.build.f_cpu=40000000L
#avrea.menu.clock.40crystal.build.speed=40
#avrea.menu.clock.40crystal.build.clocksource=1
#avrea.menu.clock.24extclock=24 MHz ext. clock (overclocked)
#avrea.menu.clock.24extclock.build.f_cpu=24000000L
#avrea.menu.clock.24extclock.build.speed=24
#avrea.menu.clock.24extclock.build.clocksource=2
#avrea.menu.clock.25extclock=25 MHz ext. clock (overclocked)
#avrea.menu.clock.25extclock.build.f_cpu=25000000L
#avrea.menu.clock.25extclock.build.speed=25
#avrea.menu.clock.25extclock.build.clocksource=2
#avrea.menu.clock.28extclock=28 MHz ext. clock (overclocked)
#avrea.menu.clock.28extclock.build.f_cpu=28000000L
#avrea.menu.clock.28extclock.build.speed=28
#avrea.menu.clock.28extclock.build.clocksource=2
#avrea.menu.clock.32extclock=32 MHz ext. clock (overclocked)
#avrea.menu.clock.32extclock.build.f_cpu=32000000L
#avrea.menu.clock.32extclock.build.speed=32
#avrea.menu.clock.32extclock.build.clocksource=2
#avrea.menu.clock.36extclock=36 MHz ext. clock (overclocked)
#avrea.menu.clock.36extclock.build.f_cpu=36000000L
#avrea.menu.clock.36extclock.build.speed=36
#avrea.menu.clock.36extclock.build.clocksource=2
#avrea.menu.clock.40extclock=40 MHz ext. clock (overclocked)
#avrea.menu.clock.40extclock.build.f_cpu=40000000L
#avrea.menu.clock.40extclock.build.speed=40
#avrea.menu.clock.40extclock.build.clocksource=2
#avrea.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
#avrea.menu.clock.48extclock.build.f_cpu=48000000L
#avrea.menu.clock.48extclock.build.speed=48
#avrea.menu.clock.48extclock.build.clocksource=2

#------------------------------------#
# BrownOut detection (BOD) option   #
#____________________________________#
#                               #
#    Completely speculative     #
#_______________________________#
#avrea.menu.bodvoltage.1v9=1.9V
#avrea.menu.bodvoltage.1v9.bootloader.bodlevbits=000
#avrea.menu.bodvoltage.2v45=2.45V
#avrea.menu.bodvoltage.2v45.bootloader.bodlevbits=001
#avrea.menu.bodvoltage.2v70=2.70V
#avrea.menu.bodvoltage.2v70.bootloader.bodlevbits=010
#avrea.menu.bodvoltage.2v85=2.85V
#avrea.menu.bodvoltage.2v85.bootloader.bodlevbits=011
#avrea.menu.bodmode.disabled=Disabled/Disabled
#avrea.menu.bodmode.enabled=Enabled/Enabled
#avrea.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
#avrea.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
#avrea.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
#avrea.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
#avrea.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
#avrea.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
#avrea.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
#avrea.menu.bodmode.disabled.bootloader.BODCFG=0x00
#avrea.menu.bodmode.enabled.bootloader.bodmodebits=00101
#avrea.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
#avrea.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
#avrea.menu.bodmode.samplefast.bootloader.bodmodebits=01010
#avrea.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
#avrea.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
#avrea.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
#avrea.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#------------------------------------#
# Retain EEPROM (EESAVE)             #
#____________________________________#
#                               #
#  Speculative but likely       #
#_______________________________#
#avrea.menu.eesave.enable=EEPROM retained
#avrea.menu.eesave.enable.bootloader.eesavebit=1
#avrea.menu.eesave.disable=EEPROM not retained
#avrea.menu.eesave.disable.bootloader.eesavebit=0

#------------------------------------#
# Reset pin as INPUT, UPDI as I/O    #
#____________________________________#
#                               #
#  Values speculative           #
#  Features Known               #
#_______________________________#
#avrea.menu.resetupdipins.resetupdi=Reset & UPDI
#avrea.menu.resetupdipins.resetupdi.bootloader.resetpinbits=11
#avrea.menu.resetupdipins.inputupdi=Input & UPDI (no challenges)
#avrea.menu.resetupdipins.inputupdi.bootloader.resetpinbits=10
#avrea.menu.resetupdipins.resetgpio=Reset & GPIO (HV pulse RST for UPDI)
#avrea.menu.resetupdipins.resetgpio.bootloader.resetpinbits=01
#avrea.menu.resetupdipins.inputgpio=Input & GPIO (HV pulse RST for UPDI)
#avrea.menu.resetupdipins.inputgpio.bootloader.resetpinbits=00

#------------------------------------#
# millis/micros timing source        #
#____________________________________#
#avrea.menu.millis.tcb2=TCB2 (recommended)
#avrea.menu.millis.disabled=Disabled
#avrea.menu.millis.tcb0=TCB0
#avrea.menu.millis.tcb1=TCB1
#avrea.menu.millis.tcb3=TCB3
#avrea.menu.millis.tca0=TCA0
#avrea.menu.millis.tca1=TCA1
##avrea.menu.millis.rtc=RTC (no micros)
##avrea.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
##avrea.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
#avrea.menu.millis.tcb0.build.millistimer=B0
#avrea.menu.millis.tcb1.build.millistimer=B1
#avrea.menu.millis.tcb2.build.millistimer=B2
#avrea.menu.millis.tcb3.build.millistimer=B3
#avrea.menu.millis.tca0.build.millistimer=A0
#avrea.menu.millis.tca1.build.millistimer=A1
##avrea.menu.millis.rtc.build.millistimer=RTC
##avrea.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
##avrea.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
#avrea.menu.millis.disabled.build.millistimer=NONE

