SpenceKonde/DxCore/megaavr/boards.txt
#------------------------------------#
# millis/micros timing source        #
#____________________________________#
avrdbopti.menu.millis.tcb2=TCB2 (recommended)
avrdbopti.menu.millis.disabled=Disabled (delay() only)
avrdbopti.menu.millis.tcb0=TCB0
avrdbopti.menu.millis.tcb1=TCB1
avrdbopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdbopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdbopti.menu.millis.tca0=TCA0
avrdbopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
#avrdbopti.menu.millis.tcd0=TCD0
#avrdbopti.menu.millis.rtc=RTC (no micros)
#avrdbopti.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal no micros
#avrdbopti.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrdbopti.menu.millis.tcb0.build.millistimer=B0
avrdbopti.menu.millis.tcb1.build.millistimer=B1
avrdbopti.menu.millis.tcb2.build.millistimer=B2
avrdbopti.menu.millis.tcb3.build.millistimer=B3
avrdbopti.menu.millis.tcb4.build.millistimer=B4
avrdbopti.menu.millis.tca0.build.millistimer=A0
avrdbopti.menu.millis.tca1.build.millistimer=A1
#avrdbopti.menu.millis.tcd0.build.millistimer=D0
#avrdbopti.menu.millis.rtc.build.millistimer=RTC
#avrdbopti.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrdbopti.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrdbopti.menu.millis.disabled.build.millistimer=NONE

#------------------------------------#
# printf() version options           #
#____________________________________#
avrdbopti.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
avrdbopti.menu.printf.full=Full, 2.6k, prints floats
avrdbopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdbopti.menu.printf.full.build.printfabr=.pfF
avrdbopti.menu.printf.minimal=Minimal, 1.1k flash used
avrdbopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdbopti.menu.printf.minimal.build.printfabr=.pfM

#------------------------------------#
# attachInterrupt Mode               #
#____________________________________#
avrdbopti.menu.attach.allenabled=On all pins, like usual
avrdbopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdbopti.menu.attach.manual=Only enabled ports. Please see documentation.
avrdbopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdbopti.menu.attach.oldversion=Old version, (may fix bugs)
avrdbopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD

#------------------------------------#
# MVIO menu                          #
#____________________________________#
avrdbopti.menu.mvio.enabled=Enabled
avrdbopti.menu.mvio.enabled.bootloader.mviobits=01
avrdbopti.menu.mvio.disabled=Disabled
avrdbopti.menu.mvio.disabled.bootloader.mviobits=10

#------------------------------------#
# Startup time options               #
#____________________________________#
avrdbopti.menu.startuptime.8= 8ms
avrdbopti.menu.startuptime.0= 0ms
avrdbopti.menu.startuptime.1= 1ms
avrdbopti.menu.startuptime.2= 2ms
avrdbopti.menu.startuptime.4= 4ms
avrdbopti.menu.startuptime.16= 16ms
avrdbopti.menu.startuptime.32= 32ms
avrdbopti.menu.startuptime.64= 64ms
avrdbopti.menu.startuptime.0.bootloader.sutbits=000
avrdbopti.menu.startuptime.1.bootloader.sutbits=001
avrdbopti.menu.startuptime.2.bootloader.sutbits=010
avrdbopti.menu.startuptime.4.bootloader.sutbits=011
avrdbopti.menu.startuptime.8.bootloader.sutbits=100
avrdbopti.menu.startuptime.16.bootloader.sutbits=101
avrdbopti.menu.startuptime.32.bootloader.sutbits=110
avrdbopti.menu.startuptime.64.bootloader.sutbits=111

#------------------------------------#
# Optiboot upload timeout            #
#____________________________________#
avrdbopti.menu.timeout.1sec=1 second (for use w/autoreset)
avrdbopti.menu.timeout.1sec.bootloader.timeout=
avrdbopti.menu.timeout.8sec=8 second (for use w/out autoreset)
avrdbopti.menu.timeout.8sec.bootloader.timeout=_8sec

#------------------------------------#
# Optiboot serial port               #
#____________________________________#
avrdbopti.menu.bootloaderusart.ser0_alt=USART0 (alt): TX PA4, RX PA5
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.portname=Serial
avrdbopti.menu.bootloaderusart.ser0_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser0=USART0 (default pins): TX PA0, RX PA1 (int. clock only)
avrdbopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdbopti.menu.bootloaderusart.ser0.bootloader.portname=Serial
avrdbopti.menu.bootloaderusart.ser0.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1
avrdbopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdbopti.menu.bootloaderusart.ser1.bootloader.portname=Serial1
avrdbopti.menu.bootloaderusart.ser1.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser1_alt=USART1 (alt): TX PC4, RX PC5 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.portname=Serial1
avrdbopti.menu.bootloaderusart.ser1_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser2=USART2: TX PF0, RX PF1
avrdbopti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdbopti.menu.bootloaderusart.ser2.bootloader.portname=Serial2
avrdbopti.menu.bootloaderusart.ser2.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser2_alt=USART2 (alt): TX PF4, RX PF5 (32+-pin only)
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.portname=Serial2
avrdbopti.menu.bootloaderusart.ser2_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser3=USART3: TX PB0, RX PB1 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdbopti.menu.bootloaderusart.ser3.bootloader.portname=Serial3
avrdbopti.menu.bootloaderusart.ser3.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser3_alt=USART3 (alt): TX PB4, RX PB5 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.portname=Serial3
avrdbopti.menu.bootloaderusart.ser3_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser4=USART4: TX PE0, RX PE1 (48/64-pin only)
avrdbopti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdbopti.menu.bootloaderusart.ser4.bootloader.portname=Serial4
avrdbopti.menu.bootloaderusart.ser4.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser4_alt=USART4 (alt): TX PE4, RX PE5 (64-pin only)
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.portname=Serial4
avrdbopti.menu.bootloaderusart.ser4_alt.bootloader.portswap=1
avrdbopti.menu.bootloaderusart.ser5=USART5: TX PG0, RX PG1 (64-pin only)
avrdbopti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdbopti.menu.bootloaderusart.ser5.bootloader.portname=Serial5
avrdbopti.menu.bootloaderusart.ser5.bootloader.portswap=0
avrdbopti.menu.bootloaderusart.ser5_alt=USART5 (alt): TX PG4, RX PG5 (64-pin only)
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.portname=Serial5
avrdbopti.menu.bootloaderusart.ser5_alt.bootloader.portswap=1



##########################################################################
#                                                                        #
#   ###  #     # ####      ####  ####            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # #   #          #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  ####            ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DD parts   #
#________________________________________#
#avrddopti.build.board=avrdd
#avrddopti.build.core=dxcore
#avrddopti.build.text_section_start=.text=0x200
#avrddopti.build.extra_flags=-DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT
#avrddopti.build.export_merged_output=false
#avrddopri.build.highestcb=B2
#avrddopti.build.printf=
#------------------------------------#
# Bootloading parameters and fuses   #
#____________________________________#
#avrddopti.bootloader.tool=avrdude
#avrddopti.bootloader.WDTCFG=0x00
#avrddopti.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
#avrddopti.bootloader.SYSCFG0=0b110{bootloader.resetpinbits}000
#avrddopti.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
##avrddopti.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
#avrddopti.bootloader.CODESIZE=0x00
#avrddopti.bootloader.BOOTSIZE=0x01
#avrddopti.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
#avrddopti.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex -a write

#------------------------------------#
# Exported hex/lst/map names will    #
# indicate selected options. These   #
# are only to do that, nothing else  #
#____________________________________#
#avrddopti.build.mcupostfix=opti
#avrddopti.build.printfabr=
#avrddopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DD submenu options                 #
#________________________________________#
# Chip (memory and pincount)         #
# 14/20-pin parts get default millis #
# changed just like tinyAVRs do      #
#____________________________________#
#avrddopti.menu.chip.64DD14=AVR64DD14
#avrddopti.menu.chip.64DD14.build.mcu=avr64dd14
#avrddopti.menu.chip.64DD14.bootloader.file=optiboot_dd64
#avrddopti.menu.chip.64DD14.upload.maximum_size=65024
#avrddopti.menu.chip.64DD14.upload.maximum_data_size=8192
#avrddopti.menu.chip.64DD14.build.highestcb=B1
#avrddopti.menu.chip.64DD14.build.variant=14pin-ddseries
#avrddopti.menu.chip.64DD20=AVR64DD20
#avrddopti.menu.chip.64DD20.build.mcu=avr64dd20
#avrddopti.menu.chip.64DD20.bootloader.file=optiboot_dd64
#avrddopti.menu.chip.64DD20.upload.maximum_size=65024
#avrddopti.menu.chip.64DD20.upload.maximum_data_size=8192
#avrddopti.menu.chip.64DD20.build.highestcb=B1
#avrddopti.menu.chip.64DD20.build.variant=20pin-ddseries
#avrddopti.menu.chip.64DD28=AVR64DD28
#avrddopti.menu.chip.64DD28.build.mcu=avr64dd28
#avrddopti.menu.chip.64DD28.bootloader.file=optiboot_dd64
#avrddopti.menu.chip.64DD28.upload.maximum_size=65024
#avrddopti.menu.chip.64DD28.upload.maximum_data_size=8192
#avrddopti.menu.chip.64DD28.build.variant=28pin-ddseries
#avrddopti.menu.chip.64DD32=AVR64DD32
#avrddopti.menu.chip.64DD32.build.mcu=avr64dd32
#avrddopti.menu.chip.64DD32.bootloader.file=optiboot_dd64
#avrddopti.menu.chip.64DD32.upload.maximum_size=65024
#avrddopti.menu.chip.64DD32.upload.maximum_data_size=8192
#avrddopti.menu.chip.64DD32.build.variant=32in-ddseries
#avrddopti.menu.chip.32DD14=AVR32DD14
#avrddopti.menu.chip.32DD14.build.mcu=avr32dd14
#avrddopti.menu.chip.32DD14.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.32DD14.upload.maximum_size=32256
#avrddopti.menu.chip.32DD14.upload.maximum_data_size=4096
#avrddopti.menu.chip.32DD14.build.highestcb=B1
#avrddopti.menu.chip.32DD14.build.variant=14pin-ddseries
#avrddopti.menu.chip.32DD20=AVR32DD20
#avrddopti.menu.chip.32DD20.build.mcu=avr32dd20
#avrddopti.menu.chip.32DD20.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.32DD20.upload.maximum_size=32256
#avrddopti.menu.chip.32DD20.upload.maximum_data_size=4096
#avrddopti.menu.chip.32DD20.build.highestcb=B1
#avrddopti.menu.chip.32DD20.build.variant=20pin-ddseries
#avrddopti.menu.chip.32DD28=AVR32DD28
#avrddopti.menu.chip.32DD28.build.mcu=avr32dd28
#avrddopti.menu.chip.32DD28.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.32DD28.upload.maximum_size=32256
#avrddopti.menu.chip.32DD28.upload.maximum_data_size=4096
#avrddopti.menu.chip.32DD28.build.variant=28pin-ddseries
#avrddopti.menu.chip.32DD32=AVR32DD32
#avrddopti.menu.chip.32DD32.build.mcu=avr32dd32
#avrddopti.menu.chip.32DD32.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.32DD32.upload.maximum_size=32256
#avrddopti.menu.chip.32DD32.upload.maximum_data_size=4096
#avrddopti.menu.chip.32DD32.build.variant=32in-ddseries
#avrddopti.menu.chip.16DD14=AVR16DD14
#avrddopti.menu.chip.16DD14.build.mcu=avr16dd14
#avrddopti.menu.chip.16DD14.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.16DD14.upload.maximum_size=15872
#avrddopti.menu.chip.16DD14.upload.maximum_data_size=2048
#avrddopti.menu.chip.16DD14.build.highestcb=B1
#avrddopti.menu.chip.16DD14.build.variant=14pin-ddseries
#avrddopti.menu.chip.16DD20=AVR16DD20
#avrddopti.menu.chip.16DD20.build.mcu=avr16dd20
#avrddopti.menu.chip.16DD20.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.16DD20.upload.maximum_size=15872
#avrddopti.menu.chip.16DD20.upload.maximum_data_size=2048
#avrddopti.menu.chip.16DD20.build.highestcb=B1
#avrddopti.menu.chip.16DD20.build.variant=20pin-ddseries
#avrddopti.menu.chip.16DD28=AVR16DD28
#avrddopti.menu.chip.16DD28.build.mcu=avr16dd28
#avrddopti.menu.chip.16DD28.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.16DD28.upload.maximum_size=15872
#avrddopti.menu.chip.16DD28.upload.maximum_data_size=2048
#avrddopti.menu.chip.16DD28.build.variant=28pin-ddseries
#avrddopti.menu.chip.16DD32=AVR16DD32
#avrddopti.menu.chip.16DD32.build.mcu=avr16dd32
#avrddopti.menu.chip.16DD32.bootloader.file=optiboot_dx32_16
#avrddopti.menu.chip.16DD32.upload.maximum_size=15872
#avrddopti.menu.chip.16DD32.upload.maximum_data_size=2048
#avrddopti.menu.chip.16DD32.build.variant=32in-ddseries

