SpenceKonde/DxCore/megaavr/boards.txt
#------------------------------------#
# Clock speed and source options     #
#____________________________________#
#avrddopti.menu.clock.24internal=24 MHz internal
#avrddopti.menu.clock.24internal.build.f_cpu=24000000L
#avrddopti.menu.clock.24internal.build.speed=24
#avrddopti.menu.clock.24internal.build.clocksource=0
#avrddopti.menu.clock.20internal=20 MHz internal
#avrddopti.menu.clock.20internal.build.f_cpu=20000000L
#avrddopti.menu.clock.20internal.build.speed=20
#avrddopti.menu.clock.20internal.build.clocksource=0
#avrddopti.menu.clock.16internal=16 MHz internal
#avrddopti.menu.clock.16internal.build.f_cpu=16000000L
#avrddopti.menu.clock.16internal.build.speed=16
#avrddopti.menu.clock.16internal.build.clocksource=0
#avrddopti.menu.clock.12internal=12 MHz internal
#avrddopti.menu.clock.12internal.build.f_cpu=12000000L
#avrddopti.menu.clock.12internal.build.speed=12
#avrddopti.menu.clock.12internal.build.clocksource=0
#avrddopti.menu.clock.10internal=10 MHz internal
#avrddopti.menu.clock.10internal.build.f_cpu=10000000L
#avrddopti.menu.clock.10internal.build.speed=10
#avrddopti.menu.clock.10internal.build.clocksource=0
#avrddopti.menu.clock.8internal=8 MHz internal
#avrddopti.menu.clock.8internal.build.f_cpu=8000000L
#avrddopti.menu.clock.8internal.build.speed=8
#avrddopti.menu.clock.8internal.build.clocksource=0
#avrddopti.menu.clock.4internal=4 MHz internal
#avrddopti.menu.clock.4internal.build.f_cpu=4000000L
#avrddopti.menu.clock.4internal.build.speed=4
#avrddopti.menu.clock.4internal.build.clocksource=0
#avrddopti.menu.clock.1internal=1 MHz internal
#avrddopti.menu.clock.1internal.build.f_cpu=1000000L
#avrddopti.menu.clock.1internal.build.speed=1
#avrddopti.menu.clock.1internal.build.clocksource=0
#avrddopti.menu.clock.24crystal=24 MHz crystal
#avrddopti.menu.clock.24crystal.build.f_cpu=24000000L
#avrddopti.menu.clock.24crystal.build.speed=24
#avrddopti.menu.clock.24crystal.build.clocksource=1
#avrddopti.menu.clock.20crystal=20 MHz crystal
#avrddopti.menu.clock.20crystal.build.f_cpu=20000000L
#avrddopti.menu.clock.20crystal.build.speed=20
#avrddopti.menu.clock.20crystal.build.clocksource=1
#avrddopti.menu.clock.16crystal=16 MHz crystal
#avrddopti.menu.clock.16crystal.build.f_cpu=16000000L
#avrddopti.menu.clock.16crystal.build.speed=16
#avrddopti.menu.clock.16crystal.build.clocksource=1
#avrddopti.menu.clock.12crystal=12 MHz crystal
#avrddopti.menu.clock.12crystal.build.f_cpu=12000000L
#avrddopti.menu.clock.12crystal.build.speed=12
#avrddopti.menu.clock.12crystal.build.clocksource=1
#avrddopti.menu.clock.8crystal=8 MHz crystal
#avrddopti.menu.clock.8crystal.build.f_cpu=8000000L
#avrddopti.menu.clock.8crystal.build.speed=8
#avrddopti.menu.clock.8crystal.build.clocksource=1
#avrddopti.menu.clock.24extclock=24 MHz ext. clock
#avrddopti.menu.clock.24extclock.build.f_cpu=24000000L
#avrddopti.menu.clock.24extclock.build.speed=24
#avrddopti.menu.clock.24extclock.build.clocksource=2
#avrddopti.menu.clock.20extclock=20 MHz ext. clock
#avrddopti.menu.clock.20extclock.build.f_cpu=20000000L
#avrddopti.menu.clock.20extclock.build.speed=20
#avrddopti.menu.clock.20extclock.build.clocksource=2
#avrddopti.menu.clock.16extclock=16 MHz ext. clock
#avrddopti.menu.clock.16extclock.build.f_cpu=16000000L
#avrddopti.menu.clock.16extclock.build.speed=16
#avrddopti.menu.clock.16extclock.build.clocksource=2
#avrddopti.menu.clock.12extclock=12 MHz ext. clock
#avrddopti.menu.clock.12extclock.build.f_cpu=12000000L
#avrddopti.menu.clock.12extclock.build.speed=12
#avrddopti.menu.clock.12extclock.build.clocksource=2
#avrddopti.menu.clock.8extclock=8 MHz ext. clock
#avrddopti.menu.clock.8extclock.build.f_cpu=8000000L
#avrddopti.menu.clock.8extclock.build.speed=8
#avrddopti.menu.clock.8extclock.build.clocksource=2
#avrddopti.menu.clock.28internal=28 MHz internal (overclocked)
#avrddopti.menu.clock.28internal.build.f_cpu=28000000L
#avrddopti.menu.clock.28internal.build.speed=28
#avrddopti.menu.clock.28internal.build.clocksource=0
#avrddopti.menu.clock.32internal=32 MHz internal (overclocked)
#avrddopti.menu.clock.32internal.build.f_cpu=32000000L
#avrddopti.menu.clock.32internal.build.speed=32
#avrddopti.menu.clock.32internal.build.clocksource=0
#avrddopti.menu.clock.25crystal=25 MHz crystal (slightly overclocked)
#avrddopti.menu.clock.25crystal.build.f_cpu=25000000L
#avrddopti.menu.clock.25crystal.build.speed=25
#avrddopti.menu.clock.25crystal.build.clocksource=1
#avrddopti.menu.clock.28crystal=28 MHz crystal (overclocked)
#avrddopti.menu.clock.28crystal.build.f_cpu=28000000L
#avrddopti.menu.clock.28crystal.build.speed=28
#avrddopti.menu.clock.28crystal.build.clocksource=1
#avrddopti.menu.clock.32crystal=32 MHz crystal (overclocked)
#avrddopti.menu.clock.32crystal.build.f_cpu=32000000L
#avrddopti.menu.clock.32crystal.build.speed=32
#avrddopti.menu.clock.32crystal.build.clocksource=1
#avrddopti.menu.clock.36crystal=36 MHz crystal (overclocked)
#avrddopti.menu.clock.36crystal.build.f_cpu=36000000L
#avrddopti.menu.clock.36crystal.build.speed=36
#avrddopti.menu.clock.36crystal.build.clocksource=1
#avrddopti.menu.clock.40crystal=40 MHz crystal (overclocked)
#avrddopti.menu.clock.40crystal.build.f_cpu=40000000L
#avrddopti.menu.clock.40crystal.build.speed=40
#avrddopti.menu.clock.40crystal.build.clocksource=1
#avrddopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
#avrddopti.menu.clock.25extclock.build.f_cpu=25000000L
#avrddopti.menu.clock.25extclock.build.speed=25
#avrddopti.menu.clock.25extclock.build.clocksource=2
#avrddopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
#avrddopti.menu.clock.28extclock.build.f_cpu=28000000L
#avrddopti.menu.clock.28extclock.build.speed=28
#avrddopti.menu.clock.28extclock.build.clocksource=2
#avrddopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
#avrddopti.menu.clock.32extclock.build.f_cpu=32000000L
#avrddopti.menu.clock.32extclock.build.speed=32
#avrddopti.menu.clock.32extclock.build.clocksource=2
#avrddopti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
#avrddopti.menu.clock.36extclock.build.f_cpu=36000000L
#avrddopti.menu.clock.36extclock.build.speed=36
#avrddopti.menu.clock.36extclock.build.clocksource=2
#avrddopti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
#avrddopti.menu.clock.40extclock.build.f_cpu=40000000L
#avrddopti.menu.clock.40extclock.build.speed=40
#avrddopti.menu.clock.40extclock.build.clocksource=2
#avrddopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
#avrddopti.menu.clock.48extclock.build.f_cpu=48000000L
#avrddopti.menu.clock.48extclock.build.speed=48
#avrddopti.menu.clock.48extclock.build.clocksource=2

#------------------------------------#
# BrownOut detection (BOD) options   #
#____________________________________#
#avrddopti.menu.bodvoltage.1v9=1.9V
#avrddopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
#avrddopti.menu.bodvoltage.2v45=2.45V
#avrddopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
#avrddopti.menu.bodvoltage.2v70=2.70V
#avrddopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
#avrddopti.menu.bodvoltage.2v85=2.85V
#avrddopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
#avrddopti.menu.bodmode.disabled=Disabled/Disabled
#avrddopti.menu.bodmode.enabled=Enabled/Enabled
#avrddopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
#avrddopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
#avrddopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
#avrddopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
#avrddopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
#avrddopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
#avrddopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
#avrddopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
#avrddopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
#avrddopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
#avrddopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
#avrddopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
#avrddopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
#avrddopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
#avrddopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
#avrddopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#------------------------------------#
# Reset pin as INPUT, UPDI as I/O    #
#____________________________________#
#avrddopti.menu.resetupdipinsopti.reset=Reset & UPDI
#avrddopti.menu.resetupdipinsopti.reset.bootloader.resetpinbits=11
#avrddopti.menu.resetupdipinsopti.input=Input & UPDI (no reset to enter optiboot)
#avrddopti.menu.resetupdipinsopti.input.bootloader.resetpinbits=10
#avrddopti.menu.resetupdipinsopti.reset=Reset & GPIO (HV pulse RST for UPDI)
#avrddopti.menu.resetupdipinsopti.reset.bootloader.resetpinbits=01
#avrddopti.menu.resetupdipinsopti.input=Input & GPIO (no reset, HV pulse for UPDI)
#avrddopti.menu.resetupdipinsopti.input.bootloader.resetpinbits=00

#------------------------------------#
# millis/micros timing source        #
#____________________________________#
#avrddopti.menu.millis.tcbhighest=TCB2 on 28/32pin else TCB1 (recommended)
#avrddopti.menu.millis.disabled=Disabled (delay() only)
#avrddopti.menu.millis.tcb0=TCB0
#avrddopti.menu.millis.tcb1=TCB1 (same as first option on 14/20 pins)
##avrddopti.menu.millis.rtc=RTC (no micros)
##avrddopti.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal no micros
##avrddopti.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
#avrddopti.menu.millis.tcb0.build.millistimer={build.highestcb}
#avrddopti.menu.millis.tcb1.build.millistimer=B0
#avrddopti.menu.millis.tcb2.build.millistimer=B1
#avrddopti.menu.millis.tca0.build.millistimer=A0
##avrddopti.menu.millis.tcd0.build.millistimer=D0
##avrddopti.menu.millis.rtc.build.millistimer=RTC
##avrddopti.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
##avrddopti.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
#avrddopti.menu.millis.disabled.build.millistimer=NONE

#------------------------------------#
# printf() version options           #
#____________________________________#
#avrddopti.menu.printf.default=Default, 1.5k flash, no floats
#avrddopti.menu.printf.full=Full, 2.6k, prints floats
#avrddopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrddopti.menu.printf.full.build.printfabr=.pfF
#avrddopti.menu.printf.minimal=Minimal, 1.1k flash used
#avrddopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrddopti.menu.printf.minimal.build.printfabr=.pfM

#------------------------------------#
# MVIO                               #
#____________________________________#
#avrddopti.menu.mvio.enabled=Enabled
#avrddopti.menu.mvio.enabled.bootloader.mviobits=01
#avrddopti.menu.mvio.disabled=Disabled
#avrddopti.menu.mvio.disabled.bootloader.mviobits=10

#------------------------------------#
# Startup time options               #
#____________________________________#
#avrddopti.menu.startuptime.8= 8ms
#avrddopti.menu.startuptime.0= 0ms
#avrddopti.menu.startuptime.1= 1ms
#avrddopti.menu.startuptime.2= 2ms
#avrddopti.menu.startuptime.4= 4ms
#avrddopti.menu.startuptime.16= 16ms
#avrddopti.menu.startuptime.32= 32ms
#avrddopti.menu.startuptime.64= 64ms
#avrddopti.menu.startuptime.0.bootloader.sutbits=000
#avrddopti.menu.startuptime.1.bootloader.sutbits=001
#avrddopti.menu.startuptime.2.bootloader.sutbits=010
#avrddopti.menu.startuptime.4.bootloader.sutbits=011
#avrddopti.menu.startuptime.8.bootloader.sutbits=100
#avrddopti.menu.startuptime.16.bootloader.sutbits=101
#avrddopti.menu.startuptime.32.bootloader.sutbits=110
#avrddopti.menu.startuptime.64.bootloader.sutbits=111

#------------------------------------#
# Optiboot upload timeout            #
#____________________________________#
#avrddopti.menu.timeout.1sec=1 second (for use w/autoreset)
#avrddopti.menu.timeout.1sec.bootloader.timeout=
#avrddopti.menu.timeout.8sec=8 second (for use w/out autoreset)
#avrddopti.menu.timeout.8sec.bootloader.timeout=_8sec

#------------------------------------#
# Optiboot serial port               #
# Lots of options here....
#____________________________________#



##########################################################################
#                                                                        #
#   ###  #     # ####      #####   ###           ###          #          #
#  #   # #     # #   #     #      #   #         #   #        ###  ##     #
#  #####  #   #  ####  ### ####   #####         #   #  ###    #          #
#  #   #   # #   # #       #      #   #         #   #  #  #   #   ##     #
#  #   #    #    #  #      #####  #   #          ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# We seriously don't know enough for     #
# this level of speculation.             #
#________________________________________#
